## DataFrame

- 2차원 데이터구조 (excel, sheet와 유사)
- 행(row), 열(column) 구조

In [2]:
import pandas as pd

In [3]:
d = pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
])
d

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
d = pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
], columns=list('가나다'))
d

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
info = {
    'name': ['ruka', 'asa', 'pharita'],
    'age': [22, 18, 19]
}

In [7]:
info_df = pd.DataFrame(info)
info_df

      name  age
0     ruka   22
1      asa   18
2  pharita   19

In [8]:
info_df.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
info_df.columns

Index(['name', 'age'], dtype='object')

In [10]:
info_df.values

array([['ruka', 22],
       ['asa', 18],
       ['pharita', 19]], dtype=object)

In [11]:
info_df.dtypes

name    object
age      int64
dtype: object

In [12]:
info_df.T

         0    1        2
name  ruka  asa  pharita
age     22   18       19

### index 지정

In [13]:
info_df.index = list('abc')
info_df

      name  age
a     ruka   22
b      asa   18
c  pharita   19

### column 다루기

In [14]:
info_df.columns

Index(['name', 'age'], dtype='object')

In [15]:
print(info_df['name'])
print(type(info_df['name']))

a       ruka
b        asa
c    pharita
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [16]:
info_df[['age', 'name']] # column의 fancy indexing

   age     name
a   22     ruka
b   18      asa
c   19  pharita

In [17]:
info_df = info_df.rename(columns={'name': '이름'}) # 재할당해서 원본 변경
info_df

        이름  age
a     ruka   22
b      asa   18
c  pharita   19

In [18]:
info_df.rename(columns={'이름': 'first name'}, inplace=True) # 바로 변경
info_df

  first name  age
a       ruka   22
b        asa   18
c    pharita   19